Revit 2024 API
Transform.CreateTranslation Method
 Creates a transform that represents a translation via the specified vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static Transform CreateTranslation(
	XYZ vector
)
Visual Basic
Public Shared Function CreateTranslation ( _
	vector As XYZ _
) As Transform
Visual C++
public:
static Transform^ CreateTranslation(
	XYZ^ vector
)
Parameters
vector
Type: Autodesk.Revit.DB.XYZ
 The translation vector.
Return Value
 The new transform.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
Transform Class
Autodesk.Revit.DB Namespace